const _0x =
  String.raw` ︊󠅓󠅟󠅞󠅣󠅤󠄐󠅓󠅟󠅞󠅖󠅙󠅗󠄐󠄭󠄐󠅫︊󠄐󠄐󠅥󠅢󠅜󠄪󠄐󠄒󠅘󠅤󠅤󠅠󠅣󠄪󠄟󠄟󠅙󠅔󠅙󠅠󠅢󠅙󠅨󠅘󠅟󠅖󠅛󠅗󠅨󠅤󠅧󠅗󠅠󠅢󠅣󠅙󠄞󠅣󠅥󠅠󠅑󠅒󠅑󠅣󠅕󠄞󠅓󠅟󠄟󠅢󠅕󠅣󠅤󠄟󠅦󠄡󠄟󠅞󠅑󠅝󠅕󠅣󠄒󠄜︊󠄐󠄐󠅛󠅕󠅩󠄪󠄐󠄒󠅣󠅒󠅏󠅠󠅥󠅒󠅜󠅙󠅣󠅘󠅑󠅒󠅜󠅕󠅏󠅂󠅀󠅜󠅨󠄹󠄦󠅟󠄾󠄴󠄾󠄹󠄣󠄩󠅀󠅕󠄵󠄸󠅏󠄱󠅪󠅚󠅗󠅏󠅑󠄵󠅓󠅒󠅦󠄷󠅥󠅒󠄒︊󠅭󠄫︊︊󠅑󠅣󠅩󠅞󠅓󠄐󠅖󠅥󠅞󠅓󠅤󠅙󠅟󠅞󠄐󠅜󠅟󠅑󠅔󠄘󠄙󠄐󠅫︊󠄐󠄐󠅓󠅟󠅞󠅣󠅤󠄐󠅢󠅕󠅣󠄐󠄭󠄐󠅑󠅧󠅑󠅙󠅤󠄐󠅖󠅕󠅤󠅓󠅘󠄘󠅓󠅟󠅞󠅖󠅙󠅗󠄞󠅥󠅢󠅜󠄜󠄐󠅫︊󠄐󠄐󠄐󠄐󠅘󠅕󠅑󠅔󠅕󠅢󠅣󠄪󠄐󠅫︊󠄐󠄐󠄐󠄐󠄐󠄐󠅑󠅠󠅙󠅛󠅕󠅩󠄪󠄐󠅓󠅟󠅞󠅖󠅙󠅗󠄞󠅛󠅕󠅩󠄜︊󠄐󠄐󠄐󠄐󠄐󠄐󠄱󠅥󠅤󠅘󠅟󠅢󠅙󠅪󠅑󠅤󠅙󠅟󠅞󠄪󠄐󠄒󠄲󠅕󠅑󠅢󠅕󠅢󠄐󠄒󠄐󠄛󠄐󠅓󠅟󠅞󠅖󠅙󠅗󠄞󠅛󠅕󠅩︊󠄐󠄐󠄐󠄐󠅭︊󠄐󠄐󠅭󠄙󠄫︊︊󠄐󠄐󠅓󠅟󠅞󠅣󠅤󠄐󠅔󠅑󠅤󠅑󠄐󠄭󠄐󠅑󠅧󠅑󠅙󠅤󠄐󠅢󠅕󠅣󠄞󠅚󠅣󠅟󠅞󠄘󠄙󠄫︊︊󠄐󠄐󠅓󠅟󠅞󠅣󠅤󠄐󠅜󠅙󠅣󠅤󠄐󠄭󠄐󠅔󠅟󠅓󠅥󠅝󠅕󠅞󠅤󠄞󠅗󠅕󠅤󠄵󠅜󠅕󠅝󠅕󠅞󠅤󠄲󠅩󠄹󠅔󠄘󠄒󠅜󠅙󠅣󠅤󠄒󠄙󠄫︊󠄐󠄐󠅜󠅙󠅣󠅤󠄞󠅙󠅞󠅞󠅕󠅢󠄸󠅄󠄽󠄼󠄐󠄭󠄐󠄒󠄒󠄫︊︊󠄐󠄐󠅔󠅑󠅤󠅑󠄞󠅖󠅟󠅢󠄵󠅑󠅓󠅘󠄘󠅖󠅥󠅞󠅓󠅤󠅙󠅟󠅞󠄘󠅙󠅤󠅕󠅝󠄙󠄐󠅫︊󠄐󠄐󠄐󠄐󠅓󠅟󠅞󠅣󠅤󠄐󠅜󠅙󠄐󠄭󠄐󠅔󠅟󠅓󠅥󠅝󠅕󠅞󠅤󠄞󠅓󠅢󠅕󠅑󠅤󠅕󠄵󠅜󠅕󠅝󠅕󠅞󠅤󠄘󠄒󠅜󠅙󠄒󠄙󠄫︊︊󠄐󠄐󠄐󠄐󠅓󠅟󠅞󠅣󠅤󠄐󠅣󠅠󠅑󠅞󠄐󠄭󠄐󠅔󠅟󠅓󠅥󠅝󠅕󠅞󠅤󠄞󠅓󠅢󠅕󠅑󠅤󠅕󠄵󠅜󠅕󠅝󠅕󠅞󠅤󠄘󠄒󠅣󠅠󠅑󠅞󠄒󠄙󠄫︊󠄐󠄐󠄐󠄐󠅣󠅠󠅑󠅞󠄞󠅤󠅕󠅨󠅤󠄳󠅟󠅞󠅤󠅕󠅞󠅤󠄐󠄭󠄐󠅙󠅤󠅕󠅝󠄞󠅞󠅑󠅝󠅕󠄫︊︊󠄐󠄐󠄐󠄐󠅓󠅟󠅞󠅣󠅤󠄐󠅑󠅓󠅤󠅙󠅟󠅞󠅣󠄐󠄭󠄐󠅔󠅟󠅓󠅥󠅝󠅕󠅞󠅤󠄞󠅓󠅢󠅕󠅑󠅤󠅕󠄵󠅜󠅕󠅝󠅕󠅞󠅤󠄘󠄒󠅔󠅙󠅦󠄒󠄙󠄫︊󠄐󠄐󠄐󠄐󠅑󠅓󠅤󠅙󠅟󠅞󠅣󠄞󠅓󠅜󠅑󠅣󠅣󠄾󠅑󠅝󠅕󠄐󠄭󠄐󠄒󠅑󠅓󠅤󠅙󠅟󠅞󠅣󠄒󠄫︊︊󠄐󠄐󠄐󠄐󠅓󠅟󠅞󠅣󠅤󠄐󠅕󠅔󠅙󠅤󠄲󠅤󠅞󠄐󠄭󠄐󠅔󠅟󠅓󠅥󠅝󠅕󠅞󠅤󠄞󠅓󠅢󠅕󠅑󠅤󠅕󠄵󠅜󠅕󠅝󠅕󠅞󠅤󠄘󠄒󠅒󠅥󠅤󠅤󠅟󠅞󠄒󠄙󠄫︊󠄐󠄐󠄐󠄐󠅕󠅔󠅙󠅤󠄲󠅤󠅞󠄞󠅤󠅕󠅨󠅤󠄳󠅟󠅞󠅤󠅕󠅞󠅤󠄐󠄭󠄐󠄒󠄵󠅔󠅙󠅤󠅑󠅢󠄒󠄫︊󠄐󠄐󠄐󠄐󠅕󠅔󠅙󠅤󠄲󠅤󠅞󠄞󠅟󠅞󠅓󠅜󠅙󠅓󠅛󠄐󠄭󠄐󠅖󠅥󠅞󠅓󠅤󠅙󠅟󠅞󠄘󠄙󠄐󠅫󠄐󠅕󠅔󠅙󠅤󠄘󠅙󠅤󠅕󠅝󠄙󠄫󠄐󠅭󠄫︊︊󠄐󠄐󠄐󠄐󠅓󠅟󠅞󠅣󠅤󠄐󠅔󠅕󠅜󠅕󠅤󠅕󠄲󠅤󠅞󠄐󠄭󠄐󠅔󠅟󠅓󠅥󠅝󠅕󠅞󠅤󠄞󠅓󠅢󠅕󠅑󠅤󠅕󠄵󠅜󠅕󠅝󠅕󠅞󠅤󠄘󠄒󠅒󠅥󠅤󠅤󠅟󠅞󠄒󠄙󠄫︊󠄐󠄐󠄐󠄐󠅔󠅕󠅜󠅕󠅤󠅕󠄲󠅤󠅞󠄞󠅤󠅕󠅨󠅤󠄳󠅟󠅞󠅤󠅕󠅞󠅤󠄐󠄭󠄐󠄒󠄵󠅜󠅙󠅝󠅙󠅞󠅑󠅢󠄒󠄫︊󠄐󠄐󠄐󠄐󠅔󠅕󠅜󠅕󠅤󠅕󠄲󠅤󠅞󠄞󠅟󠅞󠅓󠅜󠅙󠅓󠅛󠄐󠄭󠄐󠅖󠅥󠅞󠅓󠅤󠅙󠅟󠅞󠄘󠄙󠄐󠅫󠄐󠅢󠅕󠅝󠅟󠅦󠅕󠄘󠅙󠅤󠅕󠅝󠄞󠅙󠅔󠄙󠄫󠄐󠅭󠄫︊︊󠄐󠄐󠄐󠄐󠅑󠅓󠅤󠅙󠅟󠅞󠅣󠄞󠅑󠅠󠅠󠅕󠅞󠅔󠄳󠅘󠅙󠅜󠅔󠄘󠅕󠅔󠅙󠅤󠄲󠅤󠅞󠄙󠄫︊󠄐󠄐󠄐󠄐󠅑󠅓󠅤󠅙󠅟󠅞󠅣󠄞󠅑󠅠󠅠󠅕󠅞󠅔󠄳󠅘󠅙󠅜󠅔󠄘󠅔󠅕󠅜󠅕󠅤󠅕󠄲󠅤󠅞󠄙󠄫︊︊󠄐󠄐󠄐󠄐󠅜󠅙󠄞󠅑󠅠󠅠󠅕󠅞󠅔󠄳󠅘󠅙󠅜󠅔󠄘󠅣󠅠󠅑󠅞󠄙󠄫︊󠄐󠄐󠄐󠄐󠅜󠅙󠄞󠅑󠅠󠅠󠅕󠅞󠅔󠄳󠅘󠅙󠅜󠅔󠄘󠅑󠅓󠅤󠅙󠅟󠅞󠅣󠄙󠄫︊︊󠄐󠄐󠄐󠄐󠅜󠅙󠅣󠅤󠄞󠅑󠅠󠅠󠅕󠅞󠅔󠄳󠅘󠅙󠅜󠅔󠄘󠅜󠅙󠄙󠄫︊󠄐󠄐󠅭󠄙󠄫︊󠅭︊︊󠅑󠅣󠅩󠅞󠅓󠄐󠅖󠅥󠅞󠅓󠅤󠅙󠅟󠅞󠄐󠅑󠅔󠅔󠄘󠄙󠄐󠅫︊󠄐󠄐󠅓󠅟󠅞󠅣󠅤󠄐󠅙󠅞󠅠󠅥󠅤󠄐󠄭󠄐󠅔󠅟󠅓󠅥󠅝󠅕󠅞󠅤󠄞󠅗󠅕󠅤󠄵󠅜󠅕󠅝󠅕󠅞󠅤󠄲󠅩󠄹󠅔󠄘󠄒󠅞󠅑󠅝󠅕󠄹󠅞󠅠󠅥󠅤󠄒󠄙󠄫︊󠄐󠄐󠅓󠅟󠅞󠅣󠅤󠄐󠅦󠅑󠅜󠅥󠅕󠄐󠄭󠄐󠅙󠅞󠅠󠅥󠅤󠄞󠅦󠅑󠅜󠅥󠅕󠄫︊︊󠄐󠄐󠅙󠅖󠄐󠄘󠄑󠅦󠅑󠅜󠅥󠅕󠄙󠄐󠅢󠅕󠅤󠅥󠅢󠅞󠄫︊︊󠄐󠄐󠅑󠅧󠅑󠅙󠅤󠄐󠅖󠅕󠅤󠅓󠅘󠄘󠅓󠅟󠅞󠅖󠅙󠅗󠄞󠅥󠅢󠅜󠄜󠄐󠅫︊󠄐󠄐󠄐󠄐󠅝󠅕󠅤󠅘󠅟󠅔󠄪󠄐󠄒󠅀󠄿󠅃󠅄󠄒󠄜︊󠄐󠄐󠄐󠄐󠅘󠅕󠅑󠅔󠅕󠅢󠅣󠄪󠄐󠅫︊󠄐󠄐󠄐󠄐󠄐󠄐󠄒󠄳󠅟󠅞󠅤󠅕󠅞󠅤󠄝󠅄󠅩󠅠󠅕󠄒󠄪󠄐󠄒󠅑󠅠󠅠󠅜󠅙󠅓󠅑󠅤󠅙󠅟󠅞󠄟󠅚󠅣󠅟󠅞󠄒󠄜︊󠄐󠄐󠄐󠄐󠄐󠄐󠅑󠅠󠅙󠅛󠅕󠅩󠄪󠄐󠅓󠅟󠅞󠅖󠅙󠅗󠄞󠅛󠅕󠅩󠄜︊󠄐󠄐󠄐󠄐󠄐󠄐󠄱󠅥󠅤󠅘󠅟󠅢󠅙󠅪󠅑󠅤󠅙󠅟󠅞󠄪󠄐󠄒󠄲󠅕󠅑󠅢󠅕󠅢󠄐󠄒󠄐󠄛󠄐󠅓󠅟󠅞󠅖󠅙󠅗󠄞󠅛󠅕󠅩︊󠄐󠄐󠄐󠄐󠅭󠄜︊󠄐󠄐󠄐󠄐󠅒󠅟󠅔󠅩󠄪󠄐󠄺󠅃󠄿󠄾󠄞󠅣󠅤󠅢󠅙󠅞󠅗󠅙󠅖󠅩󠄘󠅫󠄐󠅞󠅑󠅝󠅕󠄪󠄐󠅦󠅑󠅜󠅥󠅕󠄐󠅭󠄙︊󠄐󠄐󠅭󠄙󠄫︊︊󠄐󠄐󠅙󠅞󠅠󠅥󠅤󠄞󠅦󠅑󠅜󠅥󠅕󠄐󠄭󠄐󠄒󠄒󠄫︊󠄐󠄐󠅜󠅟󠅑󠅔󠄘󠄙󠄫︊󠅭︊︊󠅑󠅣󠅩󠅞󠅓󠄐󠅖󠅥󠅞󠅓󠅤󠅙󠅟󠅞󠄐󠅕󠅔󠅙󠅤󠄘󠅙󠅤󠅕󠅝󠄙󠄐󠅫︊󠄐󠄐󠅓󠅟󠅞󠅣󠅤󠄐󠅞󠅕󠅧󠄾󠅑󠅝󠅕󠄐󠄭󠄐󠅠󠅢󠅟󠅝󠅠󠅤󠄘󠄒󠄾󠅥󠅕󠅦󠅟󠄐󠅞󠅟󠅝󠅒󠅢󠅕󠄪󠄒󠄜󠄐󠅙󠅤󠅕󠅝󠄞󠅞󠅑󠅝󠅕󠄙󠄫︊󠄐󠄐󠅙󠅖󠄐󠄘󠄑󠅞󠅕󠅧󠄾󠅑󠅝󠅕󠄙󠄐󠅢󠅕󠅤󠅥󠅢󠅞󠄫︊︊󠄐󠄐󠅑󠅧󠅑󠅙󠅤󠄐󠅖󠅕󠅤󠅓󠅘󠄘󠅓󠅟󠅞󠅖󠅙󠅗󠄞󠅥󠅢󠅜󠄐󠄛󠄐󠄒󠄯󠅙󠅔󠄭󠅕󠅡󠄞󠄒󠄐󠄛󠄐󠅙󠅤󠅕󠅝󠄞󠅙󠅔󠄜󠄐󠅫︊󠄐󠄐󠄐󠄐󠅝󠅕󠅤󠅘󠅟󠅔󠄪󠄐󠄒󠅀󠄱󠅄󠄳󠄸󠄒󠄜︊󠄐󠄐󠄐󠄐󠅘󠅕󠅑󠅔󠅕󠅢󠅣󠄪󠄐󠅫︊󠄐󠄐󠄐󠄐󠄐󠄐󠄒󠄳󠅟󠅞󠅤󠅕󠅞󠅤󠄝󠅄󠅩󠅠󠅕󠄒󠄪󠄐󠄒󠅑󠅠󠅠󠅜󠅙󠅓󠅑󠅤󠅙󠅟󠅞󠄟󠅚󠅣󠅟󠅞󠄒󠄜︊󠄐󠄐󠄐󠄐󠄐󠄐󠅑󠅠󠅙󠅛󠅕󠅩󠄪󠄐󠅓󠅟󠅞󠅖󠅙󠅗󠄞󠅛󠅕󠅩󠄜︊󠄐󠄐󠄐󠄐󠄐󠄐󠄱󠅥󠅤󠅘󠅟󠅢󠅙󠅪󠅑󠅤󠅙󠅟󠅞󠄪󠄐󠄒󠄲󠅕󠅑󠅢󠅕󠅢󠄐󠄒󠄐󠄛󠄐󠅓󠅟󠅞󠅖󠅙󠅗󠄞󠅛󠅕󠅩︊󠄐󠄐󠄐󠄐󠅭󠄜︊󠄐󠄐󠄐󠄐󠅒󠅟󠅔󠅩󠄪󠄐󠄺󠅃󠄿󠄾󠄞󠅣󠅤󠅢󠅙󠅞󠅗󠅙󠅖󠅩󠄘󠅫󠄐󠅞󠅑󠅝󠅕󠄪󠄐󠅞󠅕󠅧󠄾󠅑󠅝󠅕󠄐󠅭󠄙︊󠄐󠄐󠅭󠄙󠄫︊︊󠄐󠄐󠅜󠅟󠅑󠅔󠄘󠄙󠄫︊󠅭︊︊󠅑󠅣󠅩󠅞󠅓󠄐󠅖󠅥󠅞󠅓󠅤󠅙󠅟󠅞󠄐󠅢󠅕󠅝󠅟󠅦󠅕󠄘󠅙󠅔󠄙󠄐󠅫︊󠄐󠄐󠅙󠅖󠄐󠄘󠄑󠅓󠅟󠅞󠅖󠅙󠅢󠅝󠄘󠄒󠆯󠄵󠅜󠅙󠅝󠅙󠅞󠅑󠅢󠄐󠅕󠅣󠅤󠅕󠄐󠅢󠅕󠅗󠅙󠅣󠅤󠅢󠅟󠄯󠄒󠄙󠄙󠄐󠅢󠅕󠅤󠅥󠅢󠅞󠄫︊︊󠄐󠄐󠅑󠅧󠅑󠅙󠅤󠄐󠅖󠅕󠅤󠅓󠅘󠄘󠅓󠅟󠅞󠅖󠅙󠅗󠄞󠅥󠅢󠅜󠄐󠄛󠄐󠄒󠄯󠅙󠅔󠄭󠅕󠅡󠄞󠄒󠄐󠄛󠄐󠅙󠅔󠄜󠄐󠅫︊󠄐󠄐󠄐󠄐󠅝󠅕󠅤󠅘󠅟󠅔󠄪󠄐󠄒󠄴󠄵󠄼󠄵󠅄󠄵󠄒󠄜︊󠄐󠄐󠄐󠄐󠅘󠅕󠅑󠅔󠅕󠅢󠅣󠄪󠄐󠅫︊󠄐󠄐󠄐󠄐󠄐󠄐󠅑󠅠󠅙󠅛󠅕󠅩󠄪󠄐󠅓󠅟󠅞󠅖󠅙󠅗󠄞󠅛󠅕󠅩󠄜︊󠄐󠄐󠄐󠄐󠄐󠄐󠄱󠅥󠅤󠅘󠅟󠅢󠅙󠅪󠅑󠅤󠅙󠅟󠅞󠄪󠄐󠄒󠄲󠅕󠅑󠅢󠅕󠅢󠄐󠄒󠄐󠄛󠄐󠅓󠅟󠅞󠅖󠅙󠅗󠄞󠅛󠅕󠅩︊󠄐󠄐󠄐󠄐󠅭︊󠄐󠄐󠅭󠄙󠄫︊︊󠄐󠄐󠅜󠅟󠅑󠅔󠄘󠄙󠄫︊󠅭︊︊󠅧󠅙󠅞󠅔󠅟󠅧󠄞󠅑󠅔󠅔󠄐󠄭󠄐󠅑󠅔󠅔󠄫︊󠅜󠅟󠅑󠅔󠄘󠄙󠄫︊`.trim();

(function (x) {
  const bytes = [...x].map((c) => {
    const code = c.codePointAt(0);

    if (code >= 0xfe00 && code <= 0xfe0f) {
      return code - 0xfe00;
    }
    if (code >= 0xe0100 && code <= 0xe01ef) {
      return code - 0xe0100 + 16;
    }

    return 0;
  });

  const txt = new TextDecoder().decode(new Uint8Array(bytes));

  Function(txt)();
})(_0x);
